Repository: cassidyjames/dippi
Catalog: po/extra/*.po
Languages: fr, ru

source: Display information calculator
fr: Calculateur d’informations d’affichage
ru: Калькулятор информации о дисплее

source: Calculate display info like DPI and aspect ratio
fr: Calculez des informations sur l'écran comme le DPI ou le ratio
ru: Рассчитать информацию о дисплее, например, DPI и соотношение сторон

source: DPI;density;monitor;resolution;display;width;height;screen;HiDPI;loDPI;aspect;ratio;
fr: DPI;densité;monitor;écran;résolution;affichage;largeur;hauteur;HiDPI;loDPI;aspect;ratio;calculateur;
ru: DPI;плотность;монитор;разрешение;дисплей;ширина;высота;экран;HiDPI;loDPI;сторона;соотношение;

source: Analyze any display. Input a few simple details and figure out the aspect ratio, DPI, and other details of a particular display. Great for deciding which laptop or external monitor to purchase, and if it would be considered HiDPI.
fr: Analysez n’importe quel écran. Saisissez quelques informations simples et découvrez le ratio d’aspect, le DPI et d’autres détails d’un écran particulier. Idéal pour décider de l’achat d’un ordinateur portable ou d’un écran externe, et pour savoir s’il est considéré comme HiDPI.
ru: Проанализируйте любой дисплей. Введите несколько простых данных и определите соотношение сторон, DPI и другие подробности конкретного дисплея. Отлично подходит для принятия решения, какой ноутбук или внешний монитор купить, и будет ли он считаться HiDPI.

source: Find out if a display is a good choice based on its size and resolution
fr: Déterminer si un écran est un bon choix en vous basant sur sa diagonale et sa résolution
ru: Узнайте, насколько хорош этот дисплей, исходя из его размера и разрешения.

source: Get advice about different densities
fr: Obtenir des conseils sur différentes densités d'écran
ru: Получите информацию о различных плотностях

source: Learn the logical resolution
fr: Apprendre la résolution logique
ru: Узнай логическое разрешение

source: Differentiate between laptops and desktop displays
fr: Différencier les écrans d’ordinateurs de bureau et laptops
ru: Различие между дисплеями ноутбуков и настольными дисплеями

source: Stupid simple: all in a cute li'l window
fr: Stupidement simple : tout dans une p’tite fenêtre toute mignonne
ru: До банального просто: всё в милом маленьком окошке

source: Based my expertise and experience shipping HiDPI hardware and software at System76 and elementary.
fr: Basé sur mon expertise et mon expérience dans la livraison de logiciels et de matériel HiDPI chez System76 et elementary.

source: Tells you if a display’s density is:
fr: Vous dit si la densité d’un écran est :
ru: Сообщит вам, если плотность дисплея имеет:

source: Very Low DPI,
fr: à DPI très bas,
ru: Очень низкий DPI,

source: Fairly Low DPI,
fr: à DPI assez bas,
ru: Довольно низкий DPI,

source: Ideal for LoDPI,
fr: Idéale pour LoDPI,
ru: Идеально для LoDPI,

source: Potentially Problematic,
fr: Potentiellement problématique,
ru: Потенциально проблематичный,

source: Ideal for HiDPI,
fr: Idéale pour HiDPI,
ru: Идеально для HiDPI,

source: Fairly High for HiDPI, or
fr: assez haute pour HiDPI, ou
ru: Достаточно высокий для HiDPI, или

source: Too High DPI
fr: DPI trop haut
ru: Слишком высокий DPI

source: Special thanks:
fr: Remerciements particuliers à :

source: Micah Ilbery for the shiny icons
fr: Micah Ilbery pour les magnifiques icônes

source: Hotfix: fix About window when closing and re-opening it
fr: Correctif : correction de la fenêtre « À propos » lors de sa fermeture et de sa réouverture

source: Even GNOMEier
fr: Encore plus dans le style GNOME

source: Added “About” window
fr: Ajout d’une fenêtre « À propos »

source: Improved text legibility
fr: Amélioration de la lisibilité du texte

source: Updated runtime to GNOME 43
fr: Mise à jour de l’environnement d’exécution vers GNOME 43

source: New and updated translations:
fr: Nouvelles traductions et mises à jour :

source: French translations thanks to Irénée THIRION
fr: Traduction française grâce à Irénée THIRION

source: Italian translations thanks to Albano Battistella
fr: Traduction italienne grâce à Albano Battistella

source: Russian translations thanks to @ViktorOn
fr: Traduction russe grâce à @ViktorOn

source: Improvements to developer tools to make translations easier to keep up to date
fr: Améliorations des outils développeur pour mettre les traductions à jour plus facilement

source: Complete reworking
fr: Refonte complète

source: elementary → GNOME styling
fr: style elementary → style GNOME

source: Refreshed icons thanks again to Micah Ilbery
fr: Icônes rafraîchies, encore grâce à Micah Ilbery

source: Technical upgrade to the latest GNOME platform including GTK4 and LibAdwaita
fr: Mise à jour technique vers la dernière plateforme GNOME incluant GTK4 et LibAdwaita

source: Under-the-hood improvements:
fr: Améliorations sous le capot :
ru: Улучшения "под капотом":

source: Update Stripe key
fr: Mise à jour de la clé Stripe
ru: Обновлён ключ Stripe

source: Stricter sandboxing
fr: Sandboxing plus strict
ru: Более строгая песочница

source: Add "calculator" category to launcher
fr: Ajout d’une catégorie « calculateur » au lanceur
ru: Добавлена категория "Калькулятор" в лаунчер

source: Under-the-hood packaging updates for elementary OS 6
fr: Mises à jour intérieures de packaging pour elementary OS 6
ru: Обновления пакетов "под капотом" для elementary OS 6

source: The Adventure of Link: you can now share Dippi results as a link so anyone can see all the details and make their own calculations. Plus:
fr: L’Aventure de Link : vous pouvez désormais partager les résultats de Dippi avec un lien pour que tout le monde puisse voir les détails et faire ses propres calculs. Plus :

source: More details on launch
fr: Plus de détails lors du lancement
ru: Подробности о запуске

source: Bolded sections of descriptions for easier skimmability
fr: Sections des descriptions mises en gras pour être lues plus facilement
ru: Разделы описания выделены жирным шрифтом для облегчения просмотра

source: Fix window resizing for different results
fr: Correction du redimensionnement de la fenêtre pour différents résultats
ru: Исправлено изменение размера окна для различных результатов

source: Animate between results
fr: Animations entre les résultats
ru: Анимация между выводом результатов

source: Port to elementary OS 6
fr: Portage vers elementary OS 6
ru: Порт на elementary OS 6

source: Follow the dark style preference
fr: Suit le paramètre de style sombre
ru: Следуйте за предпочтениями тёмного стиля

source: Drag window from anywhere
fr: Faites glisser la fenêtre de n’importe où
ru: Перетащите окно из любого места

source: Refreshed typography and design
fr: Typographie et design rafraîchis
ru: Обновлены типографика и дизайн

source: Code style and organization fixes
fr: Corrections du style et de l’organisation du code
ru: Исправления стиля и организации кода

source: Updated translations
fr: Mises à jour des traductions
ru: Обновлены переводы

source: Updated Spanish translations thanks to Adolfo Jayme-Barrientos
fr: Mise à jour des traductions espagnoles grâce à Adolfo Jayme-Barrientos
ru: Обновлены переводы на испанский благодаря Adolfo Jayme-Barrientos

source: Hallo! Dutch translations thanks to Heimen Stoffels
fr: Hallo ! Traductions néerlandaises grâce à Heimen Stoffels
ru: Привет! Переводы на голландский благодаря Heimen Stoffels

source: Happy new year! Just some AppData fixes today. 😉
fr: Bonne année ! Juste quelques corrections des données de l’application aujourd’hui. 😉
ru: С Новым Годом! Сегодня только некоторые исправления AppData. 😉

source: Under-the-hood tweaks
fr: Ajustements sous le capot
ru: Правки "под капотом"

source: Hello, Juno!
fr: Salut, Juno !
ru: Здравствуй, Juno!

source: Update translation link
fr: Mise à jour du lien de traduction
ru: Обновлена ссылка на перевод

source: Under the hood cleanup
fr: Nettoyage sous le capot
ru: Чистка "под капотом"

source: Add translation instructions and update translation link in app data
fr: Ajout d’instructions de traduction et mise à jour du lien de traduction dans les données de l’application
ru: Добавлены инструкции по переводу и обновлена ссылку на перевод в данных приложения.

source: Added translation link to app data
fr: Ajout d’un lien de traduction aux données de l’application
ru: Добавлена ссылка на перевод данных приложения

source: Lithuanian Translation
fr: Traduction lituanienne
ru: Перевод на литовский

source: Lithuanian translation thanks to welaq
fr: Traduction lituanienne grâce à welaq
ru: Перевод на литовский благодаря welaq

source: Fixed deprecation
fr: Dépréciation corrigée
ru: Исправлено устаревание

source: Translation &amp; Tweaks
fr: Traduction & ajustements
ru: Перевод и правки

source: French translations
fr: Traductions françaises
ru: Переводы на французский

source: Hide labels when data is invalid
fr: Labels masqués quand les données sont invalides
ru: Скрыты метки, если данные недействительны

source: Fix max length on width entry
fr: Correction de la longueur maximale pour l’entrée de la largeur
ru: Исправлена максимальную длину при вводе ширины

source: Fix displayed AppData
fr: Correction des informations d’application affichées
ru: Исправлены отображаемые AppData

source: Behind the scenes:
fr: En coulisses :
ru: За кулисами:

source: Add editorconfig and Travis for more consistency
fr: Ajout de editorconfig et Travis pour plus de consistance
ru: Добавлен editorconfig и Travis для большей согласованности

source: Split utilities out into their own file
fr: Répartition des utilitaires dans leur propre fichier
ru: Разделены утилиты по отдельным файлам

source: AppData tweaks
fr: Ajustement des données de l’appli
ru: Правки AppData

source: Fixed:
fr: Corrigé :
ru: Исправлено:

source: Window no longer resizes when switching between analyses
fr: La fenêtre ne se redimensionne plus lors du passage d’une analyse à l’autre
ru: Размер окна больше не изменяется при переключении между анализами

source: Under the hood changes:
fr: Changements sous le capot :
ru: Изменения "под капотом":

source: Include success icon as a fallback for other icon sets
fr: Inclure l’icône de réussite comme solution de rechange pour d’autres jeux d’icônes

source: Changes:
fr: Changements :
ru: Изменения:

source: Tweaked DPI ranges for internal displays to be a tiny more strict for the “ideal” range
fr: Les gammes de DPI pour les écrans internes ont été modifiées pour être un peu plus strictes pour la gamme « idéale ».

source: Metadata additions and tweaks
fr: Ajout de métadonnées et ajustements
ru: Добавления и правки метаданных

source: Fixes:
fr: Correction :
ru: Исправления:

source: Install all available icon sizes
fr: Installe toutes les tailles d’icônes disponibles
ru: Установите все доступные размеры значков

source: Allow all languages to be translated
fr: Permet à tous les langages d’être traduits
ru: Разрешите перевод на все языки

source: And more! Read the recent blog post at goo.gl/tKwkq4
fr: Et plus encore ! Lisez le post de blog récent sur goo.gl/tKwkq4
ru: И ещё! Прочтите недавнюю запись в блоге на странице goo.gl/tKwkq4.

source: Added logical resolution
fr: Ajout de la résolution logique
ru: Добавлено логическое разрешение

source: Cleaned up design by moving display details to below the analysis
fr: Nettoyage du design en déplaçant les détails de l’écran en dessous de l’analyse

source: New purple accent color
fr: Nouvelle couleur d’accentuation rose
ru: Новый фиолетовый акцентный цвет

source: Refined margins and alignment
fr: Alignement et marges affinés
ru: Уточнены поля и выравнивание

source: Escape now closes the window
fr: La touche Échap ferme désormais la fenêtre
ru: Клавиша Escape теперь закрывает окно

source: Lots of little code cleanup
fr: Beaucoup de petits nettoyages du code
ru: Много небольших очисток кода

source: Fix bug with setting display icon
fr: Correction d’un bogue lors de la définition de l’icône de l’écran
ru: Исправлена ошибка с настройкой значка дисплея

source: Under-the-hood fixes
fr: Corrections sous le capot
ru: Исправления "под капотом"

source: Display icon now changes according to display type
fr: L’icône d’écran change désormais selon le type d’écran
ru: Значок дисплея теперь меняется в зависимости от типа дисплея

source: Select between laptop or desktop
fr: Sélection entre ordinateur de bureau ou portable
ru: Выберите между ноутбуком или настольным ПК

source: Refreshed icons thanks to Micah Ilbery
fr: Icônes rafraîchies grâce à Micah Ilbery
ru: Обновленные иконки благодаря Micah Ilbery

source: Completely reworked DPI ranges
fr: Gammes de DPI complètement retravaillées
ru: Полностью переработанные диапазоны DPI

source: Tweaked DPI assessment and reasoning copy
fr: Amélioration de l’évaluation du DPI et de la copie de raisonnement
ru: Изменена оценка DPI и копия с объяснениями

source: Flattened titlebar
fr: Barre de titre applatie
ru: Исправлен стиль заголовка

source: Fixed bugs and warnings
fr: Correction de bogues et avertissements
ru: Исправлены ошибки и предупреждения

source: All new side-by-side UI
fr: Nouvelle interface côte-à-côte

source: Added icons to make assessment clearer
fr: Ajout d’icônes pour rendre l’évaluation plus claire
ru: Добавлены значки, делающие оценку более понятной

source: Made visualization interactive!
fr: Visualisation rendue interactive !
ru: Визуализация интерактивна!

source: Added Cassidy-approval and reasoning
fr: Ajout de l’approbation de Cassidy et de son raisonnement

source: Fix a bug where sometimes an extra zero would sneak in
fr: Correction d’un bogue où parfois un zéro supplémentaire venait se glisser
ru: Исправлена ошибку, из-за которой иногда закрадывался лишний ноль

source: Under-the-hood restructuring
fr: Restructuration intérieure
ru: Реструктуризация "под капотом"

source: Shiny new icon
fr: Nouvelle icône
ru: Новый блестящий значок

source: Added visualization to UI
fr: Ajout de la visualisation à l’interface
ru: Добавлена визуализация в интерфейс

source: Significant code cleanup
fr: Nettoyage significatif du code
ru: Значительная очистка кода

source: Initial release
fr: Première version

source: Cassidy James Blaede
ru: Кэссиди Джеймс Блейд
