Repository: cassidyjames/dippi
Catalog: po/*.po
Languages: es, fr, it, tr

source: Crisp HiDPI text and UI along with a readable size at typical viewing distances. <b>This is the jackpot.</b>
fr: <b>Jackpot !</b> Un HiDPI net, le texte et l’interface devraient être clairs comme du cristal depuis une distance de vue normale.
it: Testo e interfaccia utente HiDPI nitidi insieme a una dimensione leggibile alla visualizzazione tipica delle distanze. <b>Questo è il jackpot.</b>

source: Fairly High for HiDPI
es: Bastante elevada para resolución alta
fr: Densité plutôt haute pour le HiDPI
it: Abbastanza alto per HiDPI
tr: HiDPI için Oldukça Yüksek

source: Text and UI are likely to appear <b>too small for typical viewing distances</b>. Increasing the text size may help.
fr: Le texte et l’interface vont peut être apparaître <b>trop petits depuis une distance de vue normale</b>. Augmenter la taille du texte pourrait être une bonne idée.
it: È probabile che il testo e l'interfaccia utente appaiano <b>troppo piccoli per le normali distanze di visualizzazione</b>. Può essere utile aumentare la dimensione del testo.

source: Text and UI will appear <b>too small for typical viewing distances</b>.
fr: Le texte et l’interface apparaîtront <b>trop petits avec une distance de vue normale</b>.
it: Il testo e l'interfaccia utente appariranno <b>troppo piccoli per le normali distanze di visualizzazione</b>.

source: Share results…
fr: Partager les résultats…
it: Condividi risultati…

source: Input a few simple details and figure out the aspect ratio, DPI, and other details of a particular display. Great for deciding which laptop or external monitor to purchase, and if it would be considered HiDPI.
fr: Entrez de simples caractéristiques techniques pour obtenir le ratio, le DPI, et d’autres détails sur un écran. Pratique pour décider quel ordinateur portable ou écran acheter, et savoir s’il sera considéré comme HiDPI.
it: Inserisci alcuni semplici dettagli e calcola le proporzioni, i DPI e altri dettagli di un particolare display. Ottimo per decidere quale laptop o monitor esterno da acquistare e se sarebbero considerati HiDPI.

source: translator-credits
fr: Irénée Thirion
it: Albano Battistella

source: elementary → GNOME styling
fr: Style elementary → GNOME

source: Desktop
es: Escritorio
fr: Ordinateur de bureau
tr: Masaüstü

source: Calculate display info like DPI and aspect ratio
es: Cálculo de datos de la pantalla como los PPP y la relación de aspecto
tr: DPI ve en boy oranı gibi ekran bilgilerini hesaplama

source: Handy features:
es: Funcionalidades útiles:
tr: Kullanışlı özellikler:

source: Based on the expertise of Cassidy James Blaede and the actual logic System76 uses to determine screen size and resolution combinations.
es: Basada en los conocimientos técnicos de Cassidy James Blaede y la lógica que System76 emplea para verificar combinaciones de tamaño y resolución en las pantallas.
tr: Cassidy James Blaede'nin uzmanlığına ve gerçek mantığa dayanarak System76'nın ekran boyutu ve çözünürlüğünü belirtmek için kullanılan uygulama.

source: Special thanks:
es: Agradecimientos especiales:
tr: Özel teşekkürler:

source: Micah Ilbery for the shiny icons
es: Micah Ilbery, por los relucientes iconos
tr: Micah Ilbery parlak simgeleri için

source: Daniel Foré for his apps to use as code examples
es: Daniel Foré, por sus aplicaciones que sirvieron como ejemplo para mi código
tr: Daniel Foré, uygulamala kod örnekleri için

source: David Jordan for helping determine DPI ranges
es: David Jordan, por su ayuda para determinar los intervalos de PPP
tr: David Jordan, DPI aralıklarının belirlenmesine yardımcı olduğu için

source: Text and UI are likely to be too big for typical viewing distances. Avoid if possible.
es: Es probable que el texto y la interfaz resulten demasiado grandes a distancias de visión habituales. Evítela en lo posible.
tr: Metin ve kullanıcı arayüzü tipik görüntüleme mesafeleri için çok büyük olabilir. Mümkünse kaçının.

source: Text and UI might be too big for typical viewing distances, but it's largely up to user preference and physical distance from the display.
es: El texto y la interfaz podrían ser demasiado grandes a distancias de visión habituales, pero depende en gran medida de la preferencia del usuario y de la distancia física con la pantalla.
tr: Metin ve kullanıcı arayüzü tipik görüntüleme mesafeleri için çok büyük olabilir, ancak büyük ölçüde kullanıcının tercihi ve ekrandan fiziksel uzaklığı kadardır.

source: Not HiDPI, but a nice sweet spot. Text and UI should be legible at typical viewing distances.
es: No es de alta resolución, mas es un punto de equilibrio óptimo. El texto y la interfaz serán legibles a distancias de visión habituales.
tr: HiDPI değil, ama hoş bir yer. Metin ve kullanıcı arayüzü tipik görüntüleme mesafelerinde okunabilir olmalıdır.

source: Relatively high resolution, but not quite HiDPI. Text and UI may be too small by default, but forcing HiDPI would make them appear too large. The experience may be slightly improved by increasing the text size.
es: La resolución es relativamente elevada sin ser «de alta resolución». Es probable que el texto y la interfaz resulten muy pequeños de manera predeterminada, y forzar una escala superior los agrandaría demasiado. Si aumenta el tamaño del texto, la experiencia puede mejorar un poco.
tr: Nispeten yüksek çözünürlük, ancak oldukça HiDPI değil. Metin ve kullanıcı arayüzü varsayılan olarak çok küçük olabilir, ancak HiDPI'yi zorlamak onları çok büyük gösterecektir. Metin boyutunu artırarak deneyim biraz iyileştirilebilir.

source: HiDPI by default, but text and UI may appear too large. Turning off HiDPI and increasing the text size might help.
es: Alta resolución de manera predeterminada, pero el texto y la interfaz pueden mostrarse demasiado grandes. Considere desactivar el modo de alta resolución y aumentar el tamaño del texto.
tr: Varsayılan olarak HiDPI, ancak metin ve kullanıcı arayüzü çok büyük görünebilir. HiDPI'yi kapatmak ve metin boyutunu artırmak yardımcı olabilir.

source: Crisp HiDPI text and UI along with a readable size at typical viewing distances. This is the jackpot.
es: El texto y la interfaz de alta resolución se mostrarán nítidos a distancias de visión habituales. Este es el premio mayor.
tr: Net HiDPI metin ve kullanıcı arayüzü ile birlikte tipik görüntüleme mesafelerinde okunabilir boyut. Bu bir ikramiye.

source: Text and UI are likely to appear too small for typical viewing distances. Increasing the text size may help.
es: Es probable que el texto y la interfaz resulten demasiado pequeños a distancias de visión habituales. Considere aumentar el tamaño del texto.
tr: Metin ve kullanıcı arayüzü tipik görüntüleme mesafeleri için çok küçük görünecektir. Metin boyutunu büyütmek yardımcı olabilir.

source: Text and UI will appear too small for typical viewing distances.
es: El texto y la interfaz se mostrarán demasiado pequeños a distancias de visión habituales.
tr: Metin ve kullanıcı arayüzü tipik görüntüleme mesafeleri için çok küçük görünecektir.

source: This display is in a very tricky range and is not likely to work well with integer scaling out of the box.
es: Esta pantalla se encuentra en un intervalo muy intricado y podría no funcionar adecuadamente con el ajuste de escala por enteros a la primera instalación.
tr: Bu ekran çok zor bir aralıktadır ve kutudan çıkan tamsayı ölçeklendirmesi ile iyi çalışma olasılığı yoktur.

source: Enter details about a display to analyze it.
es: Ingrese los datos de una pantalla para analizarla.
tr: Analiz etmek için ekranla ilgili ayrıntıları girin.

source: Diagonal size:
es: Diagonal:
tr: Çapraz boyut:

source: Resolution:
es: Resolución:
tr: Çözünürlük:

source: inches
es: pulgadas
tr: İnç

source: Type:
es: Tipo:
tr: Türü:

source: %d DPI
es: %d PPP

source: Laptop
es: Portátil

source: Tells you if a display‘s density is:
tr: Bir ekranın yoğunluğunu:
