Repository: cassidyjames/dippi
Catalog: po/*.po
Languages: es, fr, it, tr

source: Calculate display info like DPI
it: Calcola le informazioni di visualizzazione come DPI

source: Analyze any display. Input a few simple details and figure out the aspect ratio, DPI, and other details of a particular display. Great for deciding which laptop or external monitor to purchase, and if it would be considered HiDPI.
es: Análisis de cualquier pantalla. Proporcione unos pocos datos y averigüe la relación de aspecto, los PPP y otros detalles sobre una pantalla concreta. Estupendo para decidir qué portátil o monitor externo comprar y si este puede considerarse de alta resolución.
fr: Analysez n’importe quel écran. Entrez de simples caractéristiques à son propos et obtenez son ratio, son DPI, et d’autres détails. Ainsi, vous pourrez plus aisément décider quel ordinateur portable ou écran acheter, et savoir s’il sera considéré comme HiDPI.
it: Analizza qualsiasi display. Inserisci alcuni semplici dettagli e scopri le proporzioni, il DPI e altri dettagli di un particolare display. Ottimo per decidere quale laptop o monitor esterno acquistare e se sarebbe considerato HiDPI.
tr: Herhangi bir ekranı analiz edin. Birkaç basit ayrıntı girin ve en boy oranını, DPI'yi ve belirli bir ekranın diğer ayrıntılarını bulun. Hangi dizüstü bilgisayarın veya harici monitörün satın alınacağına ve HiDPI olarak kabul edilip edilmeyeceğine karar vermek için harika bir uygulama.

source: Lots of handy features:
it: Tante funzioni utili:

source: Find out if a display is a good choice based on its size and resolution
es: Descubra si una pantalla es una buena elección en función de su tamaño y su resolución
fr: Déterminer si un écran est un bon choix en vous basant sur sa diagonale et sa résolution
it: Scopri se un display è una buona scelta in base alle sue dimensioni e risoluzione
tr: Bir ekranın boyutuna ve çözünürlüğüne göre iyi bir seçim olup olmadığını öğrenin

source: Get advice about different densities
es: Obtenga orientaciones sobre las distintas densidades
fr: Obtenir des conseils sur différentes densités d'écran
it: Ottieni consigli sulle diverse densità
tr: Farklı yoğunluklar hakkında tavsiye alın

source: Learn the logical resolution
es: Conozca la resolución lógica
fr: Apprendre la résolution logique
it: Impara la risoluzione logica
tr: Mantıksal çözünürlüğü öğrenin

source: Differentiate between laptops and desktop displays
es: Distinga las pantallas para portátiles de las de escritorio
fr: Différencier les écrans d’ordinateurs de bureau et portables
it: Distinguere tra laptop e display desktop
tr: Dizüstü bilgisayarlar ve masaüstü ekranları arasında ayrım yapın

source: Stupid simple: all in a cute li'l window
es: Sencillísimo: todo en una ventanita
fr: Stupidement simple : tout dans une p’tite fenêtre toute mignonne
it: Stupido e semplice: tutto in una graziosa finestrella
tr: Kısaca:Hepsi zarif bir pencere

source: Based my expertise and experience shipping HiDPI hardware and software at System76 and elementary.
fr: Basé sur mon expertise et mon expérience dans la livraison de logiciels et de matériel HiDPI chez System76 et elementary.
it: Sulla base della mia competenza ed esperienza nella spedizione di hardware e software HiDPI presso System76 ed elementary.

source: Tells you if a display’s density is:
es: Le dice si la densidad de una pantalla es:
fr: Vous dit si la densité d’un écran est :
it: Ti dice se la densità di un display è:

source: Very Low DPI,
es: de muy pocos PPP,
fr: DPI très faible,
it: DPI molto basso,
tr: Çok Düşük DPI,

source: Fairly Low DPI,
es: de PPP relativamente escasos,
fr: DPI plutôt faible,
it: DPI abbastanza basso,
tr: Oldukça Düşük DPI,

source: Ideal for LoDPI,
es: ideal para resolución baja,
fr: Densité idéale pour le LoDPI,
it: Ideale per LoDPI,
tr: LoDPI için ideal,

source: Potentially Problematic,
es: potencialmente problemática,
fr: DPI potentiellement problématique,
it: Potenzialmente problematico,
tr: Potansiyel Olarak Sorunlu,

source: Ideal for HiDPI,
es: ideal para resolución alta,
fr: Densité idéale pour le HiDPI,
it: Ideale per HiDPI,
tr: "HiDPI için ideal,

source: Fairly High for HiDPI, or
es: bastante elevada para resolución alta, o
fr: Plutôt haute pour le HiDPI, ou
it: Abbastanza alto per HiDPI, o
tr: HiDPI için Oldukça Yüksek veya

source: Too High DPI
es: de PPP demasiado elevados
fr: DPI trop haut
it: DPI troppo alto
tr: Çok Yüksek DPI

source: Special thanks to Micah Ilbery for the shiny icons.
it: un ringraziamento speciale a Micah Ilbery per le icone scintillanti.

source: Result for a 16-inch laptop display at 3840×2160, showing it is ideal for HiDPI
it: Risultato per un display di un laptop da 16 pollici a 3840×2160, che dimostra che è ideale per HiDPI

source: Result for a 13-inch laptop display at 1920×1080, showing it is potentially problematic
it: Risultato per un display di un laptop da 13 pollici a 1920×1080, che mostra che è potenzialmente problematico

source: Result for a 27-inch desktop display at 2560×1440, showing it is ideal for loDPI
it: Risultato per un display desktop da 27 pollici a 2560×1440, che dimostra che è ideale per loDPI

source: Default state of the app, inviting you to enter a display's details
it: Stato predefinito dell'app, che ti invita a inserire i dettagli di un display

source: Better handle several common resolutions/aspect ratios
it: Gestire meglio diverse risoluzioni/rapporti d'aspetto comuni

source: Updated Italian translations thanks to Albano Battistella
it: Aggiornate le traduzioni in italiano grazie ad Albano Battistella

source: Lighten up!
it: Rilassati!

source: Lighter icon color for a fresh aesthetic and better contrast
it: Colore dell'icona più chiaro per un'estetica fresca e un contrasto migliore

source: Improved app store listing with a shorter summary and new brand colors
it: Elenco dell'app store migliorato con un riepilogo più breve e nuovi colori del marchio

source: Updated for GNOME 46
it: Aggiornato per GNOME 46

source: Updated translations:
it: Traduzioni aggiornate:

source: Updated French translations thanks to Irénée Thirion
it: Aggionate le raduzioni in francese grazie a Irénée Thirion

source: Updated Australian English thanks to Ben Beasley
it: Inglese australiano aggiornato grazie a Ben Beasley

source: Updated British English thanks to Ben Beasley
it: Inglese britannico aggiornato grazie a Ben Beasley

source: GNOME 45 and crash fix
it: GNOME 45 e correzione degli arresti anomali

source: Translations and GNOME 44
it: Traduzioni e GNOME 44

source: Hotfix: fix About window when closing and re-opening it
fr: Correctif : correction de la fenêtre « À propos » lors de sa fermeture et de sa réouverture
it: Hotfix: correzione della finestra Informazioni durante la chiusura e la riapertura

source: Even GNOMEier
fr: Encore plus dans le style GNOME
it: Anche GNOMEier

source: Added “About” window
fr: Ajout d’une fenêtre « À propos »
it: Aggiunta la finestra “Informazioni”.

source: Improved text legibility
fr: Amélioration de la lisibilité du texte
it: Leggibilità del testo migliorata

source: Updated runtime to GNOME 43
fr: Mise à jour de l’environnement d’exécution vers GNOME 43
it: Runtime aggiornato a GNOME 43

source: New and updated translations:
fr: Nouvelles traductions et mises à jour :
it: Nuove traduzioni e aggiornate:

source: French translations thanks to Irénée Thirion
it: Traduzioni in francese grazie a Irénée Thirion

source: Italian translations thanks to Albano Battistella
fr: Traduction italienne grâce à Albano Battistella
it: Traduzioni in italiano grazie ad Albano Battistella

source: Russian translations thanks to @ViktorOn
fr: Traduction russe grâce à @ViktorOn
it: Traduzioni in russo grazie a @ViktorOn

source: Improvements to developer tools to make translations easier to keep up to date
fr: Améliorations des outils développeur pour mettre les traductions à jour plus facilement
it: Miglioramenti agli strumenti per sviluppatori per rendere le traduzioni più facili da tenere aggiornate.

source: Complete reworking
fr: Refonte complète
it: Completa rielaborazione

source: Refreshed icons thanks again to Micah Ilbery
fr: Icônes rafraîchies, encore grâce à Micah Ilbery
it: Icone rinnovate grazie ancora a Micah Ilbery

source: Technical upgrade to the latest GNOME platform including GTK4 and LibAdwaita
fr: Mise à jour technique vers la dernière plateforme GNOME incluant GTK4 et LibAdwaita
it: Aggiornamento tecnico all'ultima piattaforma GNOME, incluse GTK4 e LibAdwaita

source: Under-the-hood improvements:
fr: Améliorations sous le capot :
it: Miglioramenti sotto il cofano:

source: Update Stripe key
fr: Mise à jour de la clé Stripe
it: Aggiornato la Stripe key

source: Stricter sandboxing
fr: Confinement plus strict
it: Sandboxing più rigoroso

source: Add "calculator" category to launcher
fr: Ajout dans la catégorie « calculateur » du lanceur d’applications
it: Aggiunto la categoria "calcolatrice" al programma di avvio

source: Under-the-hood packaging updates for elementary OS 6
fr: Mises à jour interne de packaging pour elementary OS 6
it: Aggiornamenti del pacchetto sotto il cofano per il sistema operativo elementary 6

source: The Adventure of Link: you can now share Dippi results as a link so anyone can see all the details and make their own calculations. Plus:
fr: Les aventures de Link : vous pouvez désormais partager les résultats de Dippi via un lien pour que tout le monde puisse en voir les détails et faire ses propres calculs. De plus :
it: L'avventura di Link: ora puoi condividere i risultati di Dippi come link così chiunque può vedere tutti i dettagli e fare i propri calcoli. Inoltre:

source: More details on launch
fr: Plus de détails lors du lancement
it: Maggiori dettagli sull'avvio

source: Bolded sections of descriptions for easier skimmability
fr: Sections des descriptions mises en gras pour faciliter la lecture
it: Sezioni delle descrizioni in grassetto per una più facile scremabilità

source: Fix window resizing for different results
fr: Correction du redimensionnement de la fenêtre pour des résultats différents
it: Risolto il problema del ridimensionamento della finestra per risultati diversi

source: Animate between results
fr: Animations entre les résultats
it: Animazione tra i risultati

source: Port to elementary OS 6
fr: Portage vers elementary OS 6
it: Port su elementary OS 6

source: Follow the dark style preference
fr: Suit la préférence de style sombre
it: Segue la preferenza di stile scuro

source: Drag window from anywhere
fr: Possibilité de déplacer la fenêtre de n’importe où
it: Trascina la finestra da qualsiasi punto

source: Refreshed typography and design
fr: Typographie et design rafraîchis
it: Design e tipografia aggiornati

source: Code style and organization fixes
fr: Corrections du style et de l’organisation du code
it: Correzioni di stile e organizzazione del codice

source: Updated Spanish translations thanks to Adolfo Jayme-Barrientos
fr: Traduction espagnole mise à jour grâce à Adolfo Jayme-Barrientos
it: Traduzione spagnola aggiornata grazie ad Adolfo Jayme-Barrientos

source: Hallo! Dutch translations thanks to Heimen Stoffels
fr: Hallo ! Traduction néerlandaise grâce à Heimen Stoffels
it: Ciao! Traduzioni in olandese grazie a Heimen Stoffels

source: Happy new year! Just some AppData fixes today. 😉
fr: Bonne année ! Simplement quelques corrections des données d’application aujourd’hui. 😉
it: Felice anno nuovo! Solo alcune correzioni di AppData oggi. 😉

source: Under-the-hood tweaks
fr: Ajustements sous le capot
it: Modifiche sotto il cofano

source: Hello, Juno!
fr: Bonjour Junon !
it: Ciao, Juno!

source: Update translation link
fr: Mise à jour du lien de traduction
it: Aggiornato collegamento alla traduzione

source: Under the hood cleanup
fr: Nettoyage sous la surface
it: Pulizia sotto il cofano

source: Add translation instructions and update translation link in app data
fr: Ajout d’instructions de traduction et mise à jour du lien de traduction dans les données d’application
it: Aggiunto le istruzioni di traduzione e aggiornato il link di traduzione nei dati dell'app

source: Added translation link to app data
fr: Ajout d’un lien de traduction dans les données d’application
it: Aggiunto collegamento di traduzione ai dati dell'app

source: Lithuanian Translation
fr: Traduction lituanienne
it: Traduzione lituana

source: Lithuanian translation thanks to welaq
fr: Traduction lituanienne grâce à welaq
it: Traduzione lituana grazie a welaq

source: Fixed deprecation
fr: Correction d’une dépréciation
it: Deprecazioni corrette

source: French translations
fr: Traductions françaises
it: traduzioni francesi

source: Hide labels when data is invalid
fr: Masquage des étiquettes lorsque les données sont invalides
it: Nascondi le etichette quando i dati non sono validi

source: Fix max length on width entry
fr: Correction de la longueur maximale lors de la saisie de la largeur
it: Risolto la lunghezza massima all'ingresso della larghezza

source: Fix displayed AppData
fr: Corrections des données d’application affichées
it: Risolto il problema con AppData visualizzati

source: Behind the scenes:
fr: En coulisses :
it: Dietro le quinte:

source: Add editorconfig and Travis for more consistency
fr: Ajout de editorconfig et de Travis pour plus de cohérence
it: Aggiunto editorconfig e Travis per una maggiore coerenza

source: Split utilities out into their own file
fr: Séparation des utilitaires dans leur propre fichier
it: Dividi le utilità nel proprio file

source: AppData tweaks
fr: Ajustement des données d’application
it: Modifiche a AppData

source: Fixed:
fr: Correction :
it: Corretto:

source: Window no longer resizes when switching between analyses
fr: La fenêtre ne se redimensionne plus lors d’un changement d’analyse
it: La finestra non si ridimensiona più quando si passa da un'analisi all'altra

source: Under the hood changes:
fr: Changements sous le capot :
it: Cambia sotto il cofano:

source: Include success icon as a fallback for other icon sets
fr: Inclusion d’une icône de réussite comme solution de rechange pour d’autres ensembles d’icônes
it: Includi l'icona di successo come fallback per altri set di icone

source: Changes:
fr: Changements :
it: Modifiche:

source: Tweaked DPI ranges for internal displays to be a tiny more strict for the “ideal” range
fr: Ajustement de la gamme de DPI pour les écrans internes pour un panel « idéal » plus strict
it: Intervalli DPI ottimizzati per i display interni per essere un po' più severi per la gamma “ideale”

source: Metadata additions and tweaks
fr: Ajout de métadonnées et améliorations
it: Aggiunte e modifiche ai metadati

source: Fixes:
fr: Corrections :
it: Correzioni:

source: Install all available icon sizes
fr: Installe toutes les tailles d’icônes disponibles
it: Installa tutte le dimensioni delle icone disponibili

source: Allow all languages to be translated
fr: Permet une traduction multilingue
it: Consenti la traduzione di tutte le lingue

source: And more! Read the recent blog post at goo.gl/tKwkq4
fr: Et plus encore ! Lisez le récent article de blog sur goo.gl/tKwkq4
it: E altro ancora! Leggi il recente post del blog su goo.gl/tKwkq4

source: Added logical resolution
fr: Ajout de la résolution logique
it: Aggiunta risoluzione logica

source: Cleaned up design by moving display details to below the analysis
fr: Design perfectionné en déplaçant les détails de l’écran sous l’analyse
it: Design pulito spostando i dettagli del display al di sotto dell'analisi

source: New purple accent color
fr: Nouvelle couleur violette d’accentuation
it: Nuovo colore viola

source: Refined margins and alignment
fr: Marges et alignement affinés
it: Rifinitura dei margini e allineamento

source: Escape now closes the window
fr: La touche Échap ferme désormais la fenêtre
it: Il tasto Esc ora chiude la finestra

source: Lots of little code cleanup
fr: Beaucoup de petits nettoyage du code
it: Un sacco di piccola pulizia del codice

source: Fix bug with setting display icon
fr: Correction d’un bogue affectant l’icône de l’écran
it: Risolto un bug con l'impostazione dell'icona di visualizzazione

source: Under-the-hood fixes
fr: Corrections sous le capot
it: Correzioni sotto il cofano

source: Display icon now changes according to display type
fr: L’icône de l’écran change désormais selon le type d’écran
it: L'icona del display ora cambia in base al tipo di display

source: Select between laptop or desktop
fr: Sélection entre ordinateur de bureau et laptop
it: Scegli tra laptop o desktop

source: Refreshed icons thanks to Micah Ilbery
fr: Icônes rafraîchies grâce à Micah Ilbery
it: Icone rinnovate grazie a Michea Ilbery

source: Completely reworked DPI ranges
fr: Panels de DPI retravaillés
it: Intervalli DPI completamente rielaborati

source: Tweaked DPI assessment and reasoning copy
fr: Amélioration de l’évaluation du DPI et du raisonnement
it: Valutazione DPI ottimizzata e copia ragionevole

source: Flattened titlebar
fr: Barre de titre applatie
it: Barra del titolo appiattita

source: Fixed bugs and warnings
fr: Correction de bogues et avertissements
it: Risolti bug e avvisi

source: All new side-by-side UI
fr: Disposition en côte à côte de l’interface
it: Tutta la nuova interfaccia utente affiancata

source: Added icons to make assessment clearer
fr: Ajout d’icônes pour rendre l’évaluation plus claire
it: Aggiunte icone per rendere più chiara la valutazione

source: Made visualization interactive!
fr: Visualisation rendue interactive !
it: Resa interattiva la visualizzazione!

source: Added Cassidy-approval and reasoning
fr: Ajout de l’approbation Cassidy et de la ratio de l’application
it: Aggiunti l'approvazione e il ragionamento di Cassidy

source: Fix a bug where sometimes an extra zero would sneak in
fr: Correction d’un bogue où un zéro supplémentaire s’insérait parfois
it: Risolto un bug per cui a volte uno zero in più si intrufolava

source: Under-the-hood restructuring
fr: Restructuration sous la surface
it: Ristrutturazione sotto il cofano

source: Shiny new icon
fr: Nouvelle icône
it: Nuova icona scintillante

source: Added visualization to UI
fr: Ajout de la visualisation à l’interface
it: Aggiunta visualizzazione all'interfaccia utente

source: Significant code cleanup
fr: Nettoyage significatif du code
it: Pulizia significativa del codice

source: Initial release
fr: Première version
it: Versione iniziale

source: Display information calculator
es: Calculadora de datos de pantalla
fr: Calculateur d’informations d’affichage
it: Visualizza informazioni del calcolatore
tr: Bilgi hesaplayıcısını görüntüle

source: DPI;density;monitor;resolution;display;width;height;screen;HiDPI;loDPI;aspect;ratio;
es: DPI;PPP;densidad;monitor;resolución;pantalla;anchura;altura;visualizador;HiDPI;loDPI;aspecto;relación;
fr: DPI;densité;affichage;écran;résolution;largeur;hauteur;HiDPI;loDPI;aspect;ratio;calculateur;
it: DPI;densità;monitor;risoluzione;visualizzazione;larghezza;altezza;schermo;HiDPI;loDPI;proporzioni;
tr: DPI;yoğunluk;monitor;çözünürlük;görüntü;en;boy;ekran;HiDPI;loDPI;

source: Analyze a Display
es: Analizar una pantalla
fr: Analyser un affichage
it: Analizza un display
tr: Bir Ekranı Analiz Edin

source: Very Low DPI
es: PPP muy bajos
fr: DPI très faible
it: DPI molto basso
tr: Çok Düşük DPI

source: Text and UI are likely to be too big for typical viewing distances. <b>Avoid if possible.</b>
fr: Le texte et l’interface peuvent être trop grands depuis des distances de vue normales. <b>Évitez cette configuration si possible</b>
it: È probabile che il testo e l'interfaccia utente siano troppo grandi per le normali distanze di visualizzazione. <b>Evita se possibile.</b>

source: Fairly Low DPI
es: PPP relativamente escasos
fr: DPI plutôt faible
it: DPI abbastanza basso
tr: Oldukça Düşük DPI

source: Text and UI might be too big for typical viewing distances, but it's <b>largely up to user preference</b> and physical distance from the display.
fr: Le texte et l’interface peuvent être trop grands depuis des distances de vue normales, mais cela <b>dépend en grande partie des préférences de l’utilisateur</b> et de la distance physique de l’écran.
it: Il testo e l'interfaccia utente potrebbero essere troppo grandi per le normali distanze di visualizzazione, ma è <b>dipendente in gran parte dalle preferenze dell'utente</b> e dalla distanza fisica dal display.

source: Ideal for LoDPI
es: Ideal para resolución baja
fr: Densité idéale pour le LoDPI
it: Ideale per LoDPI
tr: LoDPI için ideal

source: Not HiDPI, but <b>a nice sweet spot</b>. Text and UI should be legible at typical viewing distances.
fr: Pas de HiDPI, mais <b>un entre-deux agréable</b>. Le texte et l’interface devraient être visibles depuis une distance de vue normale.
it: Non HiDPI, ma <b>un bel punto debole</b>. Il testo e l'interfaccia utente dovrebbero essere leggibili nella tipica distanza di visione.

source: Potentially Problematic
es: Potencialmente problemática
fr: DPI potentiellement problématique
it: Potenzialmente problematico
tr: Potansiyel Olarak Sorunlu

source: Relatively high resolution, but not quite HiDPI. Text and UI <b>may be too small by default</b>, but forcing HiDPI would make them appear too large. The experience may be slightly improved by increasing the text size.
fr: Résolution relativement haute, mais pas encore de HiDPI. Le texte et l’interface sont <b>peut être trop petits par défaut</b>, mais forcer le HiDPI les ferait apparaître trop larges. Votre expérience devrait être améliorée en augmentant la taille du texte.
it: Risoluzione relativamente alta, ma non abbastanza HiDPI. Il testo e l'interfaccia utente <b>potrebbero essere troppo piccolo per impostazione predefinita</b>, ma forzare HiDPI li farebbe apparire troppo grandi. L'esperienza può essere leggermente migliorata aumentando la dimensione del testo.

source: Tweak for HiDPI
it: Ottimizzazione per HiDPI

source: This display may default to loDPI on some desktops, which could result in too-small text and UI. However, it <b>may be usable with HiDPI by manually enabling 2× scaling</b>. Further adjustments can be made by decreasing the text size.
it: Questo display potrebbe essere impostato di default su loDPI su alcuni desktop, il che potrebbe comportare testo e interfaccia utente troppo piccoli. Tuttavia, <b>potrebbe essere utilizzabile con HiDPI abilitando manualmente il ridimensionamento 2×</b>. Ulteriori regolazioni possono essere apportate riducendo le dimensioni del testo.

source: This display is in a very tricky range and is <b>not likely to work well</b> with integer scaling out of the box.
fr: Cet affichage est dans une gamme très délicate et <b>est susceptible de ne pas bien fonctionner</b> avec une mise à l’échelle à l’entier par défaut.
it: Questo display si trova in un intervallo molto difficile ed è <b>probabile che non funzioni bene</b> con ridimensionamento di numeri interi fuori dagli schemi.

source: HiDPI by default, but <b>text and UI may appear too large</b>. Turning off HiDPI and increasing the text size might help.
fr: HiDPI par défaut, mais <b>le texte et l’interface peuvent apparaître trop larges</b>. Enlever le HiDPI et augmenter la taille du texte devrait être un choix judicieux.
it: HiDPI per impostazione predefinita, ma <b>il testo e l'interfaccia utente potrebbero apparire troppo grandi</b>. Disattivazione HiDPI e l'aumento delle dimensioni del testo potrebbero essere d'aiuto.

source: Ideal for HiDPI
es: Ideal para resolución alta
fr: Densité idéale pour le HiDPI
it: Ideale per HiDPI
tr: HiDPI için ideal
